org/emacs.org
# Created 2015-04-11 lör 20:41
#+OPTIONS: toc:nil
#+TITLE: Emacs notes, @jmn 2013-2014
#+AUTHOR: jmn
#+STARTUP: indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.jmnorlund.net/css/base.css" />

#+BEGIN_ABSTRACT
I use Emacs for editing text under version control. Sometimes I also use it for communication such as IRC and e-mail. This is my archive of notes for the editor. This is a complement to [[/jmn][my literate Emacs configuration]].  

For information about how I maintain and publish this file, see section [[About this file]] .- /jmn, December 2014./
#+END_ABSTRACT
#+TOC: headlines 3

* Configure
Emacs provides a system called =M-x customize= which enables configuration using menus. It can be useful for easily finding which options are available. To get a more sustainable configuration which can be used on multiple systems it is generally better to use other means of configuration. 

See [[file:jmn.org]] to see how I use the org-mode format to maintain my Emacs configuration.

** Changing variables on the fly
Hit M-: to run "eval-expression".
To for example change the tab-width of the buffer, enter:
                (setq tab-width 8)
and hit RET.
* Appearance
** My current configuration <2014-12-06 lör>
- I currently use a serif font as my default emacs "face". I use Times New Roman. For colors I use the dark "tango-dark" theme. <2014-12-06 lör>
- When I feel like using less colour I use the theme "monochrome".
** Fonts and faces (Typography)
*** The default font
It is possible to use M-x customize-face, default
Personally I like to use the Consolas font on Windows.
It is possible to set the font in buffer-face-mode using =S-Leftclick=, "Change buffer font". To find out more about the face, use =M-x what-cursors-position=, or =Cu C-x ==.

#+BEGIN_SRC emacs-lisp
    (custom-set-faces
     '(default ((t (:family "Consolas" :foundry "outline" :slant normal :weight normal :height 108 :width normal))))
     '(variable-pitch ((t (:slant normal :weight light :foundry "outline" :family "Gotham HTF Light")))))
#+END_SRC
