emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs notes, @jmn 2013-2014</title>
<!-- 2015-04-11 lör 21:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="jmn" />
<link rel="stylesheet" type="text/css" href="http://www.jmnorlund.net/css/base.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs notes, @jmn 2013-2014</h1>
<div class="ABSTRACT">
<p>
I use Emacs for editing text under version control. Sometimes I also use it for communication such as IRC and e-mail. This is my archive of notes for the editor. This is a complement to <a href="http://www.jmnorlund.net/jmn">my literate Emacs configuration</a>.  
</p>

<p>
For information about how I maintain and publish this file, see section <a href="#sec-7-1">7.1</a> .- <i>jmn, December 2014.</i>
</p>

</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Configure</a>
<ul>
<li><a href="#sec-1-1">1.1. Changing variables on the fly</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Appearance</a>
<ul>
<li><a href="#sec-2-1">2.1. My current configuration <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-12-06 lör&gt;</span></span></a></li>
<li><a href="#sec-2-2">2.2. Fonts and faces (Typography)</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. The default font</a></li>
<li><a href="#sec-2-2-2">2.2.2. Buffer-face-mode / variable-pitch-mode</a></li>
<li><a href="#sec-2-2-3">2.2.3. Figuring out font names</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Fullscreen mode on Windows</a></li>
<li><a href="#sec-2-4">2.4. Create your own colour theme</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Operations</a>
<ul>
<li><a href="#sec-3-1">3.1. Operations on words (transformations)</a></li>
<li><a href="#sec-3-2">3.2. the help system</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. finding the name of an elisp function used in a menu</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Navigating</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Marking and Jumping</a></li>
<li><a href="#sec-3-3-2">3.3.2. Handling files</a></li>
<li><a href="#sec-3-3-3">3.3.3. Opening files via HTTP, SSH</a></li>
<li><a href="#sec-3-3-4">3.3.4. Searching</a></li>
<li><a href="#sec-3-3-5">3.3.5. Accessibility</a></li>
<li><a href="#sec-3-3-6">3.3.6. Bookmarks</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4. Undoing, et c</a></li>
<li><a href="#sec-3-5">3.5. Inserting special characters</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. References</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Spelling</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. Questions</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7. Troubleshooting, profiling &amp; debugging</a></li>
<li><a href="#sec-3-8">3.8. Version control</a>
<ul>
<li><a href="#sec-3-8-1">3.8.1. Magit</a></li>
<li><a href="#sec-3-8-2">3.8.2. Conflict resolution</a></li>
<li><a href="#sec-3-8-3">3.8.3. File history</a></li>
<li><a href="#sec-3-8-4">3.8.4. View Difference at various stages in history.</a></li>
</ul>
</li>
<li><a href="#sec-3-9">3.9. E-mail using gnus</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1. On Windows with GMail</a></li>
</ul>
</li>
<li><a href="#sec-3-10">3.10. IRC</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Extensions and modes</a>
<ul>
<li><a href="#sec-4-1">4.1. Shell</a></li>
<li><a href="#sec-4-2">4.2. Org-mode - the organizer</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Running the latest version</a></li>
<li><a href="#sec-4-2-2">4.2.2. Mark-up</a></li>
<li><a href="#sec-4-2-3">4.2.3. Code in org files</a></li>
<li><a href="#sec-4-2-4">4.2.4. Inserting dates and times</a></li>
<li><a href="#sec-4-2-5">4.2.5. Personal keybindings</a></li>
<li><a href="#sec-4-2-6">4.2.6. Various</a></li>
<li><a href="#sec-4-2-7">4.2.7. Scheduling time</a></li>
<li><a href="#sec-4-2-8">4.2.8. Agenda</a></li>
<li><a href="#sec-4-2-9">4.2.9. Agenda view</a></li>
<li><a href="#sec-4-2-10">4.2.10. Importing ICS icalendar files</a></li>
<li><a href="#sec-4-2-11">4.2.11. Capture</a></li>
<li><a href="#sec-4-2-12">4.2.12. Archiving</a></li>
<li><a href="#sec-4-2-13">4.2.13. Searching and filtering in org</a></li>
<li><a href="#sec-4-2-14">4.2.14. Literate programming using org-babel</a></li>
<li><a href="#sec-4-2-15">4.2.15. Exporting to HTML and other formats</a></li>
<li><a href="#sec-4-2-16">4.2.16. Editing math and special characters</a></li>
<li><a href="#sec-4-2-17">4.2.17. Further study</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Miscellaneous (git, magit, org-mode, gnus, diff &#x2026;)</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Acceptable visual configurations</a></li>
<li><a href="#sec-4-3-2">4.3.2. Text zoom, default is C-x C-+, C-x C&#x2013; to resize text.</a></li>
<li><a href="#sec-4-3-3">4.3.3. Magit for git version control</a></li>
<li><a href="#sec-4-3-4">4.3.4. Reading feeds with gnus</a></li>
<li><a href="#sec-4-3-5">4.3.5. Comparing files with diff, merging them with ediff</a></li>
<li><a href="#sec-4-3-6">4.3.6. Visibility</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Extending Emacs (Emacs Lisp)</a>
<ul>
<li><a href="#sec-5-1">5.1. Learn Emacs lisp</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. Use ‘C-x ESC ESC’ to repeat commands you execute, and look at the Emacs-Lisp code that executes them, before hitting ‘RET’ (Return) – see RepeatLastCommand.</a></li>
<li><a href="#sec-5-1-2">5.1.2. Use ‘C-h f’ (‘describe-function’) and ‘C-h v’ (‘describe-variable’) to understand commands and variables you use. In the help description, click the function or variable name (link) to go directly to the source code that defines it. Try to read the source code. When you want to know what some function you see used does, use ‘C-h f’ on it… Got it?</a></li>
<li><a href="#sec-5-1-3">5.1.3. Use ‘C-h k’ to see which commands you are executing when you use keys. Then follow the previous bullet: click the name (link) of the command to see its source code…</a></li>
<li><a href="#sec-5-1-4">5.1.4. Read the Emacs Lisp Introduction: EmacsLispIntro. Use ‘C-h i’, then choose `Emacs Lisp Intro’. You can also read this manual on the Web.</a></li>
<li><a href="#sec-5-1-5">5.1.5. Read the Emacs Lisp Reference manual: EmacsLispReference. Use ‘C-h i’, then choose ‘Elisp’ (Emacs Lisp is sometimes called “Elisp”). You can also read this manual on the Web.</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Resources</a></li>
<li><a href="#sec-5-3">5.3. Basics</a></li>
<li><a href="#sec-5-4">5.4. Evaluating lisp code</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. ielm</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5. C-x C-e evaluates last expression (Position the cursor after the expression)</a></li>
<li><a href="#sec-5-6">5.6. Debugging</a></li>
<li><a href="#sec-5-7">5.7. Useful e-lisp basics</a></li>
<li><a href="#sec-5-8">5.8. using 'package</a></li>
<li><a href="#sec-5-9">5.9. Keybindings</a></li>
<li><a href="#sec-5-10">5.10. Colortheme extension</a></li>
<li><a href="#sec-5-11">5.11. Macros</a></li>
<li><a href="#sec-5-12">5.12. Parentheses</a>
<ul>
<li><a href="#sec-5-12-1">5.12.1. Paredit</a></li>
<li><a href="#sec-5-12-2">5.12.2. Test</a></li>
<li><a href="#sec-5-12-3">5.12.3. Jump to matching parentheses</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. Personal notes</a>
<ul>
<li><a href="#sec-6-1">6.1. System/platform specific</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. My current emacs notes for Win8</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. For me to check out</a></li>
<li><a href="#sec-6-3">6.3. Wouldn't it be great if&#x2026; / Wishlist</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Meta</a>
<ul>
<li><a href="#sec-7-1">7.1. About this file</a></li>
<li><a href="#sec-7-2">7.2. <span class="todo nilTODO">TODO</span> Export both org and HTML</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Configure</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs provides a system called <code>M-x customize</code> which enables configuration using menus. It can be useful for easily finding which options are available. To get a more sustainable configuration which can be used on multiple systems it is generally better to use other means of configuration. 
</p>

<p>
See <a href="jmn.html">jmn.html</a> to see how I use the org-mode format to maintain my Emacs configuration.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Changing variables on the fly</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Hit M-: to run "eval-expression".
To for example change the tab-width of the buffer, enter:
                (setq tab-width 8)
and hit RET.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Appearance</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> My current configuration <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-12-06 lör&gt;</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>I currently use a serif font as my default emacs "face". I use Times New Roman. For colors I use the dark "tango-dark" theme. <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-12-06 lör&gt;</span></span>
</li>
<li>When I feel like using less colour I use the theme "monochrome".
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Fonts and faces (Typography)</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> The default font</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
It is possible to use M-x customize-face, default
Personally I like to use the Consolas font on Windows.
It is possible to set the font in buffer-face-mode using <code>S-Leftclick</code>, "Change buffer font". To find out more about the face, use <code>M-x what-cursors-position</code>, or <code>Cu C-x =</code>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(custom-set-faces
 '(default ((t (<span style="color: #e090d7;">:family</span> <span style="color: #e9b96e;">"Consolas"</span> <span style="color: #e090d7;">:foundry</span> <span style="color: #e9b96e;">"outline"</span> <span style="color: #e090d7;">:slant</span> normal <span style="color: #e090d7;">:weight</span> normal <span style="color: #e090d7;">:height</span> 108 <span style="color: #e090d7;">:width</span> normal))))
 '(variable-pitch ((t (<span style="color: #e090d7;">:slant</span> normal <span style="color: #e090d7;">:weight</span> light <span style="color: #e090d7;">:foundry</span> <span style="color: #e9b96e;">"outline"</span> <span style="color: #e090d7;">:family</span> <span style="color: #e9b96e;">"Gotham HTF Light"</span>)))))
</pre>
</div>
</div>
</div>
