org/emacs.org
*** Buffer-face-mode / variable-pitch-mode
For reading longer texts in Emacs it might be nice to, temporarily, use a different font, for this use buffer-face-mode.
=M-x buffer-face-mode= 
#+BEGIN_SRC emacs-lisp
    (setq buffer-face-mode-face '(:family "DejaVu Sans" :height 100 :width semi-condensed))
    (setq buffer-face-mode-face '(:family "Gotham HTF Light" :foundry "outline" :slant normal :weight light :height 113 :width normal))
    (set-face-attribute 'variable-pitch nil :family "Gotham HTF Light" :foundry "outline" :slant "normal" :weight "light" :height 113 :width "normal")
#+END_SRC

You might want to configure certain modes to automatically start in variable-pitch-mode using a mode-hook, e.g:
#+BEGIN_SRC emacs-lisp
    (add-hook 'markdown-mode-hook (lambda () (variable-pitch-mode t))
#+END_SRC

**** Using variable-pitch in org-mode
You might want tables in org-mode to still use a monospaced font (fixed-pitch):
#+BEGIN_SRC emacs-lisp
    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
#+END_SRC

For code-blocks:
#+BEGIN_SRC emacs-lisp
    (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-block-background nil :inherit 'fixed-pitch)
#+END_SRC

*** Figuring out font names
One option is to use the menu bar, Options/set default font, Options/Save options and look at the result in =~/.emacs=. Another is to use =M-x what-cursors-position, or =C-u C-x ==

** Fullscreen mode on Windows
Starting with version (=M-x version=) 24.4 Emacs supports fullscreen mode on MS Windows, use =M-x toggle-frame-fullscreen= to toggle fullsceren mode, it's bound to the key =F11=.
** Create your own colour theme
I usually start off with a basic theme that I like and then do: M-x
customize-create-theme to create my own version of the
theme. Generally I do this to reduce the amount of colours used.  See
[[http://batsov.com/articles/2012/02/19/color-theming-in-emacs-reloaded/]] for more info.

Preview and find color themes:
[[http://emacsthemes.caisah.info/]]
* Operations
** Operations on words (transformations)
Uppercase word: M-c
Lowercase word: M-l
** the help system
|-------+------------------------------|
| C-h b | show all keybindings         |
| C-h m | Show major mode key bindings |
| C-h f | explain a function           |
| C-h i | open Info                    |
|-------+------------------------------|
*** finding the name of an elisp function used in a menu
C-h c (then use a menu)
** Navigating
*** Marking and Jumping
`C-c %'
     Push the current position onto the mark ring, to be able to return
     easily. Commands following an internal link do this automatically.

`C-c &'
     Jump back to a recorded position.  A position is recorded by the
     commands following internal links, and by `C-c %'.  Using this
     command several times in direct succession moves through a ring of
     previously recorded positions.
M-z <character>, M-x zap-to-char kills text forward up to and including the given character. Useful i.e. in expressions. See [[http://superuser.com/questions/124246/emacs-equivalent-to-vim-ci]]
C-M-k kill balanced expression.

*** Handling files
|---------------------+---------+--------------------------------------------------------|
| dired-mode          | C-x d   | File explorer                                          |
| dired-jump          | C-x C-j | Open dired with cursor on the file displayed in buffer |
| find-alternate-file | C-x C-v | Displays the filename so you can yank it.              |
| revert-buffer       |         | asd                                                    |
|---------------------+---------+--------------------------------------------------------|

*** Opening files via HTTP, SSH
To open a file via HTTP(S) in Emacs, use =M-x browse-url-emacs=

Emacs can edit files over SSH using the package "tramp". 

*** Searching
**** Searching and replacing within files
|---------------|
| query-replace |
|---------------|

**** Tricks, Quoted-insert et c.
By pressing C-q C-m RET You can search for "Carriage return" (C-q is "quoted-insert).

(Carriage return is displayed in Emacs as ^M "^Hello" and can show up when you
are switching between various character encodings (dos,unix,utf-8...)
line endings.)

See more here: [[http://ergoemacs.org/emacs/emacs_line_ending_char.html]]

**** Searching across files
**** TODO file contents (grep) across many files

commands: rgrep, grep-find, grep
BUG?: Searching in "Lokala inställningar crashes" with:
local characters no such directory found via cdpath rgrep

TODO: find code for mouse-appearance-menu to bind keys for "increase
buffer text size" and "decrease..." to C-Plus, C-Minus)

TODO: find the emacsclient extension in the chrome data
dir. lokala../appdata et c.

**** replacing across files. Press Q in dired-mode. Enter regex.
**** C-x C-q in dired is extremely powerful when combined with macros (imagine changing names of some files in a large directory, but instead of having to code some script, just use the macro magic!).

**** [[http://denverdroid.blogspot.se/2011/07/cool-things-to-do-in-emacs-dired-mode.html][More dired-mode stuff]]

