emacs.html
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Buffer-face-mode / variable-pitch-mode</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
For reading longer texts in Emacs it might be nice to, temporarily, use a different font, for this use buffer-face-mode.
<code>M-x buffer-face-mode</code> 
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq buffer-face-mode-face '(<span style="color: #e090d7;">:family</span> <span style="color: #e9b96e;">"DejaVu Sans"</span> <span style="color: #e090d7;">:height</span> 100 <span style="color: #e090d7;">:width</span> semi-condensed))
(setq buffer-face-mode-face '(<span style="color: #e090d7;">:family</span> <span style="color: #e9b96e;">"Gotham HTF Light"</span> <span style="color: #e090d7;">:foundry</span> <span style="color: #e9b96e;">"outline"</span> <span style="color: #e090d7;">:slant</span> normal <span style="color: #e090d7;">:weight</span> light <span style="color: #e090d7;">:height</span> 113 <span style="color: #e090d7;">:width</span> normal))
(set-face-attribute 'variable-pitch nil <span style="color: #e090d7;">:family</span> <span style="color: #e9b96e;">"Gotham HTF Light"</span> <span style="color: #e090d7;">:foundry</span> <span style="color: #e9b96e;">"outline"</span> <span style="color: #e090d7;">:slant</span> <span style="color: #e9b96e;">"normal"</span> <span style="color: #e090d7;">:weight</span> <span style="color: #e9b96e;">"light"</span> <span style="color: #e090d7;">:height</span> 113 <span style="color: #e090d7;">:width</span> <span style="color: #e9b96e;">"normal"</span>)
</pre>
</div>

<p>
You might want to configure certain modes to automatically start in variable-pitch-mode using a mode-hook, e.g:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'markdown-mode-hook (<span style="color: #b4fa70;">lambda</span> () (variable-pitch-mode t))
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-2-2-2-1"></a>Using variable-pitch in org-mode<br  /><div class="outline-text-5" id="text-2-2-2-1">
<p>
You might want tables in org-mode to still use a monospaced font (fixed-pitch):
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'org-table nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
</pre>
</div>

<p>
For code-blocks:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'org-code nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-block nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-block-background nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Figuring out font names</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
One option is to use the menu bar, Options/set default font, Options/Save options and look at the result in <code>~/.emacs</code>. Another is to use <code>M-x what-cursors-position, or =C-u C-x =</code>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Fullscreen mode on Windows</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Starting with version (<code>M-x version</code>) 24.4 Emacs supports fullscreen mode on MS Windows, use <code>M-x toggle-frame-fullscreen</code> to toggle fullsceren mode, it's bound to the key <code>F11</code>.
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Create your own colour theme</h3>
<div class="outline-text-3" id="text-2-4">
<p>
I usually start off with a basic theme that I like and then do: M-x
customize-create-theme to create my own version of the
theme. Generally I do this to reduce the amount of colours used.  See
<a href="http://batsov.com/articles/2012/02/19/color-theming-in-emacs-reloaded/">http://batsov.com/articles/2012/02/19/color-theming-in-emacs-reloaded/</a> for more info.
</p>

<p>
Preview and find color themes:
<a href="http://emacsthemes.caisah.info/">http://emacsthemes.caisah.info/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Operations</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Operations on words (transformations)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Uppercase word: M-c
Lowercase word: M-l
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> the help system</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-h b</td>
<td class="left">show all keybindings</td>
</tr>

<tr>
<td class="left">C-h m</td>
<td class="left">Show major mode key bindings</td>
</tr>

<tr>
<td class="left">C-h f</td>
<td class="left">explain a function</td>
</tr>

<tr>
<td class="left">C-h i</td>
<td class="left">open Info</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> finding the name of an elisp function used in a menu</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
C-h c (then use a menu)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Navigating</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Marking and Jumping</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
`C-c %'
     Push the current position onto the mark ring, to be able to return
     easily. Commands following an internal link do this automatically.
</p>

<p>
`C-c &amp;'
     Jump back to a recorded position.  A position is recorded by the
     commands following internal links, and by `C-c %'.  Using this
     command several times in direct succession moves through a ring of
     previously recorded positions.
M-z &lt;character&gt;, M-x zap-to-char kills text forward up to and including the given character. Useful i.e. in expressions. See <a href="http://superuser.com/questions/124246/emacs-equivalent-to-vim-ci">http://superuser.com/questions/124246/emacs-equivalent-to-vim-ci</a>
C-M-k kill balanced expression.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Handling files</h4>
<div class="outline-text-4" id="text-3-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">dired-mode</td>
<td class="left">C-x d</td>
<td class="left">File explorer</td>
</tr>

<tr>
<td class="left">dired-jump</td>
<td class="left">C-x C-j</td>
<td class="left">Open dired with cursor on the file displayed in buffer</td>
</tr>

<tr>
<td class="left">find-alternate-file</td>
<td class="left">C-x C-v</td>
<td class="left">Displays the filename so you can yank it.</td>
</tr>

<tr>
<td class="left">revert-buffer</td>
<td class="left">&#xa0;</td>
<td class="left">asd</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3"><span class="section-number-4">3.3.3</span> Opening files via HTTP, SSH</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
To open a file via HTTP(S) in Emacs, use <code>M-x browse-url-emacs</code>
</p>

<p>
Emacs can edit files over SSH using the package "tramp". 
</p>
</div>
</div>

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4"><span class="section-number-4">3.3.4</span> Searching</h4>
<div class="outline-text-4" id="text-3-3-4">
</div><ol class="org-ol"><li><a id="sec-3-3-4-1"></a>Searching and replacing within files<br  /><div class="outline-text-5" id="text-3-3-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">query-replace</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-3-3-4-2"></a>Tricks, Quoted-insert et c.<br  /><div class="outline-text-5" id="text-3-3-4-2">
<p>
By pressing C-q C-m RET You can search for "Carriage return" (C-q is "quoted-insert).
</p>

<p>
(Carriage return is displayed in Emacs as ^M "<sup>Hello</sup>" and can show up when you
are switching between various character encodings (dos,unix,utf-8&#x2026;)
line endings.)
</p>

<p>
See more here: <a href="http://ergoemacs.org/emacs/emacs_line_ending_char.html">http://ergoemacs.org/emacs/emacs_line_ending_char.html</a>
</p>
</div>
</li>

<li><a id="sec-3-3-4-3"></a>Searching across files<br  /></li>
<li><a id="sec-3-3-4-4"></a><span class="todo TODO">TODO</span> file contents (grep) across many files<br  /><div class="outline-text-5" id="text-3-3-4-4">
<p>
commands: rgrep, grep-find, grep
BUG?: Searching in "Lokala inställningar crashes" with:
local characters no such directory found via cdpath rgrep
</p>

<p>
TODO: find code for mouse-appearance-menu to bind keys for "increase
buffer text size" and "decrease&#x2026;" to C-Plus, C-Minus)
</p>

<p>
TODO: find the emacsclient extension in the chrome data
dir. lokala../appdata et c.
</p>
</div>
</li>

<li><a id="sec-3-3-4-5"></a>replacing across files. Press Q in dired-mode. Enter regex.<br  /></li>
<li><a id="sec-3-3-4-6"></a>C-x C-q in dired is extremely powerful when combined with macros (imagine changing names of some files in a large directory, but instead of having to code some script, just use the macro magic!).<br  /></li>

<li><a id="sec-3-3-4-7"></a><a href="http://denverdroid.blogspot.se/2011/07/cool-things-to-do-in-emacs-dired-mode.html">More dired-mode stuff</a><br  /></li></ol>
</div>
