org/emacs.org
*** Accessibility
goto-adress-mode makes written hyperlinks clickable.
see [[http://stackoverflow.com/questions/3748673/emacs-23-on-os-x-how-to-open-web-links-from-emacs][here]].

Try adding:
#+BEGIN_SRC emacs-lisp
    (add-hook 'find-file-hook 'goto-address-mode)
#+END_SRC
To your dot-emacs.
*** Bookmarks
[[http://emacswiki.org/emacs/BookMarks][Emacs Bookmarks - EmacsWiki]]

|--------------+-----------------+---------------------------------------------------------|
| Shortcut key | M-x command     | Description                                             |
|--------------+-----------------+---------------------------------------------------------|
| C-x r m      |                 | set a bookmark at the current location (e.g. in a file) |
| C-x r b      |                 | jump to a bookmark                                      |
| C-x r l      |                 | list your bookmarks                                     |
|              | bookmark-delete | delete a bookmark by name                               |
|--------------+-----------------+---------------------------------------------------------|
** Undoing, et c
C-x u (or just "u" in viper) to undo.
M-x undo-only to "undo only" (not redo).
Tip: undo-tree (package) can be very useful.

** Inserting special characters
This can be done in various ways
- Using a compose key
- using M-x ucs-insert (C-x 8 RET)
C-x 8 can also be used to insert various characters, e.g:
| C-x 8 c | ¢ |
| ...   m | µ |
| ...   o | ° |
| ...   u | µ |
| S       | § |
- using abbrevs
- using agda
[[http://wiki.portal.chalmers.se/agda/agda.php?n=Docs.UnicodeInput]]
*** References
[[http://emacs-fu.blogspot.se/2012/02/special-characters.html]]
** Spelling
Note: There are various spelling engines. aspell and hunspell are two.
Hunspell is said to be more advanced, handles utf-8 and complex grammar structures (?) used in i.e. swedish.

M-x ispell
M-x ispell-change-dictionary

*** Questions
Mixed language content? i.e. Swedish/English.
** Troubleshooting, profiling & debugging
Use =M-x toggle-debug-on-error= to enable debugging for errors.

GNU Emacs 24 and later has got profile.el
#+BEGIN_SRC emacs-lisp
    (require 'profiler)
#+END_SRC

|---------------------|
| M-x profiler-start  |
| M-x profiler-report |
|---------------------|
** Version control
*** Magit
See package magit for a great git/emacs tool.

*** Conflict resolution
M-x vc-resolve-conflicts - opens three buffer windows, A (your file),
                               B (the conflicting file from the
                               repository) and C (the combined file)
                               See "?" for commands, but use keys a/b/
                               to pick either of the versions and then
                               press space to visit the next merge
                               conflict.

*** File history
M-x vc-annotate - Creates a log of who did what when.

*** View Difference at various stages in history.
M-x vc-ediff - Highlight and navigate between difference between the
file at it's current stage and previous commits (for example).
** E-mail using gnus
*** On Windows with GMail
See [[http://www.emacswiki.org/emacs/AlessandroPiras#toc]]
** IRC
See =M-x erc=

* Extensions and modes
** Shell
Enter by typing M-x shell

To clear the shell buffer, you can use M-x erase-buffer
** Org-mode - the organizer
Org mode good for things like managing todo information, capturing
notes, keeping a journal, clocking in time and more.

*** Running the latest version
See [[http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development]]

Org-mode is under active development, here are instructions to running the latest version from Git.
Basic steps: clone the repo, make autoloads, load files properly.

**** Make autoloads under MS Windows
