emacs.html

<div id="outline-container-sec-3-3-5" class="outline-4">
<h4 id="sec-3-3-5"><span class="section-number-4">3.3.5</span> Accessibility</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
goto-adress-mode makes written hyperlinks clickable.
see <a href="http://stackoverflow.com/questions/3748673/emacs-23-on-os-x-how-to-open-web-links-from-emacs">here</a>.
</p>

<p>
Try adding:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'find-file-hook 'goto-address-mode)
</pre>
</div>
<p>
To your dot-emacs.
</p>
</div>
</div>
<div id="outline-container-sec-3-3-6" class="outline-4">
<h4 id="sec-3-3-6"><span class="section-number-4">3.3.6</span> Bookmarks</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
<a href="http://emacswiki.org/emacs/BookMarks">Emacs Bookmarks - EmacsWiki</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Shortcut key</th>
<th scope="col" class="left">M-x command</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-x r m</td>
<td class="left">&#xa0;</td>
<td class="left">set a bookmark at the current location (e.g. in a file)</td>
</tr>

<tr>
<td class="left">C-x r b</td>
<td class="left">&#xa0;</td>
<td class="left">jump to a bookmark</td>
</tr>

<tr>
<td class="left">C-x r l</td>
<td class="left">&#xa0;</td>
<td class="left">list your bookmarks</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">bookmark-delete</td>
<td class="left">delete a bookmark by name</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Undoing, et c</h3>
<div class="outline-text-3" id="text-3-4">
<p>
C-x u (or just "u" in viper) to undo.
M-x undo-only to "undo only" (not redo).
Tip: undo-tree (package) can be very useful.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Inserting special characters</h3>
<div class="outline-text-3" id="text-3-5">
<p>
This can be done in various ways
</p>
<ul class="org-ul">
<li>Using a compose key
</li>
<li>using M-x ucs-insert (C-x 8 RET)
</li>
</ul>
<p>
C-x 8 can also be used to insert various characters, e.g:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x 8 c</td>
<td class="left">¢</td>
</tr>

<tr>
<td class="left">&#x2026;   m</td>
<td class="left">µ</td>
</tr>

<tr>
<td class="left">&#x2026;   o</td>
<td class="left">°</td>
</tr>

<tr>
<td class="left">&#x2026;   u</td>
<td class="left">µ</td>
</tr>

<tr>
<td class="left">S</td>
<td class="left">§</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>using abbrevs 
</li>
<li>using agda
</li>
</ul>
<p>
<a href="http://wiki.portal.chalmers.se/agda/agda.php?n=Docs.UnicodeInput">http://wiki.portal.chalmers.se/agda/agda.php?n=Docs.UnicodeInput</a>
</p>
</div>
<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> References</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
<a href="http://emacs-fu.blogspot.se/2012/02/special-characters.html">http://emacs-fu.blogspot.se/2012/02/special-characters.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Spelling</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Note: There are various spelling engines. aspell and hunspell are two.
Hunspell is said to be more advanced, handles utf-8 and complex grammar structures (?) used in i.e. swedish.
</p>

<p>
M-x ispell
M-x ispell-change-dictionary
</p>
</div>

<div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Questions</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
Mixed language content? i.e. Swedish/English.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Troubleshooting, profiling &amp; debugging</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Use <code>M-x toggle-debug-on-error</code> to enable debugging for errors.
</p>

<p>
GNU Emacs 24 and later has got profile.el
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">profiler</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">M-x profiler-start</td>
</tr>

<tr>
<td class="left">M-x profiler-report</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Version control</h3>
<div class="outline-text-3" id="text-3-8">
</div><div id="outline-container-sec-3-8-1" class="outline-4">
<h4 id="sec-3-8-1"><span class="section-number-4">3.8.1</span> Magit</h4>
<div class="outline-text-4" id="text-3-8-1">
<p>
See package magit for a great git/emacs tool.
</p>
</div>
</div>

<div id="outline-container-sec-3-8-2" class="outline-4">
<h4 id="sec-3-8-2"><span class="section-number-4">3.8.2</span> Conflict resolution</h4>
<div class="outline-text-4" id="text-3-8-2">
<p>
M-x vc-resolve-conflicts - opens three buffer windows, A (your file),
                               B (the conflicting file from the
                               repository) and C (the combined file)
                               See "?" for commands, but use keys a/b/
                               to pick either of the versions and then
                               press space to visit the next merge
                               conflict.
</p>
</div>
</div>

<div id="outline-container-sec-3-8-3" class="outline-4">
<h4 id="sec-3-8-3"><span class="section-number-4">3.8.3</span> File history</h4>
<div class="outline-text-4" id="text-3-8-3">
<p>
M-x vc-annotate - Creates a log of who did what when.
</p>
</div>
</div>

<div id="outline-container-sec-3-8-4" class="outline-4">
<h4 id="sec-3-8-4"><span class="section-number-4">3.8.4</span> View Difference at various stages in history.</h4>
<div class="outline-text-4" id="text-3-8-4">
<p>
M-x vc-ediff - Highlight and navigate between difference between the
file at it's current stage and previous commits (for example).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> E-mail using gnus</h3>
<div class="outline-text-3" id="text-3-9">
</div><div id="outline-container-sec-3-9-1" class="outline-4">
<h4 id="sec-3-9-1"><span class="section-number-4">3.9.1</span> On Windows with GMail</h4>
<div class="outline-text-4" id="text-3-9-1">
<p>
See <a href="http://www.emacswiki.org/emacs/AlessandroPiras#toc">http://www.emacswiki.org/emacs/AlessandroPiras#toc</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> IRC</h3>
<div class="outline-text-3" id="text-3-10">
<p>
See <code>M-x erc</code>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Extensions and modes</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Shell</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Enter by typing M-x shell
</p>

<p>
To clear the shell buffer, you can use M-x erase-buffer
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Org-mode - the organizer</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Org mode good for things like managing todo information, capturing
notes, keeping a journal, clocking in time and more.
</p>
</div>

<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Running the latest version</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
See <a href="http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development">http://orgmode.org/worg/org-faq.html#keeping-current-with-Org-mode-development</a>
</p>

<p>
Org-mode is under active development, here are instructions to running the latest version from Git.
Basic steps: clone the repo, make autoloads, load files properly.
</p>
</div>

<ol class="org-ol"><li><a id="sec-4-2-1-1"></a>Make autoloads under MS Windows<br  /></li>
