org/emacs.org
**** Generating autoloads and Compiling Org without make
#+INDEX: Compilation!without make

Compilation is optional, but you _must_ update the autoloads file
each time you update org, even when you run org uncompiled!

Starting with Org 7.9 you'll find functions for creating the
autoload files and do byte-compilation in =mk/org-fixup.el=.  When
you execute the commands below, your current directory must be where
org has been unpacked into, in other words the file =README= should
be found in your current directory and the directories =lisp= and
=etc= should be subdirectories of it.  The command =emacs= should be
found in your =PATH= and start the Emacs version you are using.  To
make just the autoloads file do:
: emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads
To make the autoloads file and byte-compile org:
: emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads-compile
To make the autoloads file and byte-compile all of org again:
: emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads-compile-force
If you are not using Git, you'll have to make fake version strings
first if =org-version.el= is not already available (if it is, you
could also edit the version strings there).
: emacs -batch -Q -L lisp -l ../mk/org-fixup \
: --eval '(let ((org-fake-release "7.9.1")(org-fake-git-version "7.9.1-fake"))\
: (org-make-autoloads))'
The above assumes a
POSIX shell for its quoting.  Windows =CMD.exe= has quite different
quoting rules and this won't work, so your other option is to start
Emacs like this
: emacs -Q -L lisp -l ../mk/org-fixup
then paste the following into the =*scratch*= buffer
#+BEGIN_SRC emacs-lisp
      (let ((org-fake-release     "7.9.1")
            (org-fake-git-version "7.9.1-fake"))
        (org-make-autoloads))
#+END_SRC
position the cursor after the closing paren and press =C-j= or =C-x
  C-e= to evaluate the form.  Of course you can replace
=org-make-autoloads= with =org-make-autoloads-compile= or even
=org-make-autoloads-compile-force= if you wish with both variants.

**** Reload Org

#+INDEX: Initialization!Reload

As of Org version 6.23b (released Sunday Feb 22, 2009) there is a new
function to reload org files.

Normally you want to use the compiled files since they are faster.
If you update your org files you can easily reload them with

: M-x org-reload

If you run into a bug and want to generate a useful backtrace you can
reload the source files instead of the compiled files with

: C-u M-x org-reload

and turn on the "Enter Debugger On Error" option.  Redo the action
that generates the error and cut and paste the resulting backtrace.
To switch back to the compiled version just reload again with

: M-x org-reload

*** Mark-up
[[http://orgmode.org/org.html#Emphasis-and-monospace]]

=code= +strikethrough+ *bold* /italic/ _underlined_ ~verbatim~

#+BEGIN_SRC org-mode
    =code= +strikethrough+ *bold* /italic/ _underlined_ ~verbatim~ 
#+END_SRC

Subscript_i Subscript_{i} (equivalent) Superscript~x Superscript~{x} (equivalent)

#+BEGIN_SRC
    Subscript_i Subscript_{i} (equivalent) Superscript^x Superscript^{x} (equivalent)
#+END_SRC

- More about Subscript and superscript: 
  [[http://orgmode.org/manual/Subscripts-and-superscripts.html#Subscripts-and-superscripts]]
**** Conundrum
What is up with org-mode created superscripts i.e:
="^Hello"= exports to ="<sup>Hello</sup>"= (Even when contained within equal signs. Bug?)
#+BEGIN_SRC
    ="^Hello"= exports to ="<sup>Hello</sup>"= (Even when contained within equal signs. Bug?)
#+END_SRC

Further more, HTML in a SRC code block will not be escaped properly.

#+BEGIN_SRC html
    <sup>Hello</sup>
    =<sup>Hello</sup>=
    ="<sup>Hello</sup>"=
#+END_SRC

FIXME: BUG?

*** Code in org files
To input code insert "<s" on a line and press tab. See [[http://orgmode.org/manual/Easy-Templates.html#Easy-Templates][Easy Templates]]
*** Inserting dates and times
|-------+-----+------------------|
| key   | M-x | description      |
|-------+-----+------------------|
| C-c . |     | insert timestamp |
|-------+-----+------------------|
*** Personal keybindings
|-------+------------------|
| C-c c | capture new item |
| C-c a | org-agenda       |
| C-c , | set priority     |
|-------+------------------|
*** Various

Link format \[[http...]\[foo]] (without slashes)
Example: [[http://localhost][localhost]]
Use C-c C-l with the cursor above the link to modify it.
Or, backspace after the description to remove the final bracket and unhide the URL.
See [[http://orgmode.org/manual/Link-format.html#Link-format][Documentation on links]]

*** Scheduling time
To schedule a task, use C-c C-s.
| C-c C-x ; | Start a countdown timer (just ";" in agenda views). |
**** Repeated tasks (recurring tasks)
To schedule a recurring task (or "repeated task", see info org-mode 8.3.2):
     DEADLINE: <2005-10-01 lör +1m>

Note the "+1m", that means to repeat every month.

You can use yearly, monthly, weekly, daily and hourly repeat cookies
by using the `y/w/m/d/h' letters.

If you need both a repeater and a special warning period in a deadline entry,
the repeater should come first and the warning period last: `DEADLINE:
<2005-10-01 lör +1m -3d>'.

*** Agenda
|------------------------------------+---------|
| Schedule on date                   | C-c C-s |
| Change status (started, done, etc) | C-c C-t |
| Deadline                           | C-c C-d |
| kill item                          | C-k     |
|------------------------------------+---------|

