emacs.html
<li><a id="compiling-org-without-make"></a><a id="sec-4-2-1-2"></a>Generating autoloads and Compiling Org without make<br  /><div class="outline-text-5" id="text-compiling-org-without-make">
<p>
Compilation is optional, but you <span class="underline">must</span> update the autoloads file
each time you update org, even when you run org uncompiled!
</p>

<p>
Starting with Org 7.9 you'll find functions for creating the
autoload files and do byte-compilation in <code>mk/org-fixup.el</code>.  When
you execute the commands below, your current directory must be where
org has been unpacked into, in other words the file <code>README</code> should
be found in your current directory and the directories <code>lisp</code> and
<code>etc</code> should be subdirectories of it.  The command <code>emacs</code> should be
found in your <code>PATH</code> and start the Emacs version you are using.  To
make just the autoloads file do:
</p>
<pre class="example">
emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads
</pre>
<p>
To make the autoloads file and byte-compile org:
</p>
<pre class="example">
emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads-compile
</pre>
<p>
To make the autoloads file and byte-compile all of org again:
</p>
<pre class="example">
emacs -batch -Q -L lisp -l ../mk/org-fixup -f org-make-autoloads-compile-force
</pre>
<p>
If you are not using Git, you'll have to make fake version strings
first if <code>org-version.el</code> is not already available (if it is, you
could also edit the version strings there).
</p>
<pre class="example">
emacs -batch -Q -L lisp -l ../mk/org-fixup \
--eval '(let ((org-fake-release "7.9.1")(org-fake-git-version "7.9.1-fake"))\
(org-make-autoloads))'
</pre>
<p>
The above assumes a
POSIX shell for its quoting.  Windows <code>CMD.exe</code> has quite different
quoting rules and this won't work, so your other option is to start
Emacs like this
</p>
<pre class="example">
emacs -Q -L lisp -l ../mk/org-fixup
</pre>
<p>
then paste the following into the <code>*scratch*</code> buffer
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">let</span> ((org-fake-release     <span style="color: #e9b96e;">"7.9.1"</span>)
      (org-fake-git-version <span style="color: #e9b96e;">"7.9.1-fake"</span>))
  (org-make-autoloads))
</pre>
</div>
<p>
position the cursor after the closing paren and press <code>C-j</code> or <code>C-x
  C-e</code> to evaluate the form.  Of course you can replace
<code>org-make-autoloads</code> with <code>org-make-autoloads-compile</code> or even
<code>org-make-autoloads-compile-force</code> if you wish with both variants.
</p>
</div>
</li>

<li><a id="sec-4-2-1-3"></a>Reload Org<br  /><div class="outline-text-5" id="text-4-2-1-3">
<p>
As of Org version 6.23b (released Sunday Feb 22, 2009) there is a new
function to reload org files.
</p>

<p>
Normally you want to use the compiled files since they are faster.
If you update your org files you can easily reload them with
</p>

<pre class="example">
M-x org-reload
</pre>

<p>
If you run into a bug and want to generate a useful backtrace you can
reload the source files instead of the compiled files with
</p>

<pre class="example">
C-u M-x org-reload
</pre>

<p>
and turn on the "Enter Debugger On Error" option.  Redo the action
that generates the error and cut and paste the resulting backtrace.
To switch back to the compiled version just reload again with
</p>

<pre class="example">
M-x org-reload
</pre>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Mark-up</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
<a href="http://orgmode.org/org.html#Emphasis-and-monospace">http://orgmode.org/org.html#Emphasis-and-monospace</a>
</p>

<p>
<code>code</code> <del>strikethrough</del> <b>bold</b> <i>italic</i> <span class="underline">underlined</span> <code>verbatim</code>
</p>

<div class="org-src-container">

<pre class="src src-org-mode">=code= +strikethrough+ *bold* /italic/ _underlined_ ~verbatim~
</pre>
</div>

<p>
Subscript<sub>i</sub> Subscript<sub>i</sub> (equivalent) Superscript~x Superscript~{x} (equivalent)
</p>

<pre class="example">
Subscript_i Subscript_{i} (equivalent) Superscript^x Superscript^{x} (equivalent)
</pre>

<ul class="org-ul">
<li>More about Subscript and superscript: 
<a href="http://orgmode.org/manual/Subscripts-and-superscripts.html#Subscripts-and-superscripts">http://orgmode.org/manual/Subscripts-and-superscripts.html#Subscripts-and-superscripts</a>
</li>
</ul>
</div>
<ol class="org-ol"><li><a id="sec-4-2-2-1"></a>Conundrum<br  /><div class="outline-text-5" id="text-4-2-2-1">
<p>
What is up with org-mode created superscripts i.e:
="<sup>Hello</sup>"= exports to ="&lt;sup&gt;Hello&lt;/sup&gt;"= (Even when contained within equal signs. Bug?)
</p>
<pre class="example">
="^Hello"= exports to ="&lt;sup&gt;Hello&lt;/sup&gt;"= (Even when contained within equal signs. Bug?)
</pre>

<p>
Further more, HTML in a SRC code block will not be escaped properly.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #fce94f;">sup</span>&gt;Hello&lt;/<span style="color: #fce94f;">sup</span>&gt;
=&lt;<span style="color: #fce94f;">sup</span>&gt;Hello&lt;/<span style="color: #fce94f;">sup</span>&gt;=
="&lt;<span style="color: #fce94f;">sup</span>&gt;Hello&lt;/<span style="color: #fce94f;">sup</span>&gt;"=
</pre>
</div>

<p>
FIXME: BUG?
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> Code in org files</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
To input code insert "&lt;s" on a line and press tab. See <a href="http://orgmode.org/manual/Easy-Templates.html#Easy-Templates">Easy Templates</a>
</p>
</div>
</div>
<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Inserting dates and times</h4>
<div class="outline-text-4" id="text-4-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">key</th>
<th scope="col" class="left">M-x</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-c .</td>
<td class="left">&#xa0;</td>
<td class="left">insert timestamp</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Personal keybindings</h4>
<div class="outline-text-4" id="text-4-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c c</td>
<td class="left">capture new item</td>
</tr>

<tr>
<td class="left">C-c a</td>
<td class="left">org-agenda</td>
</tr>

<tr>
<td class="left">C-c ,</td>
<td class="left">set priority</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-2-6" class="outline-4">
<h4 id="sec-4-2-6"><span class="section-number-4">4.2.6</span> Various</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
Link format \[[http&#x2026;]\[foo]] (without slashes)
Example: <a href="http://localhost/">localhost</a>
Use C-c C-l with the cursor above the link to modify it.
Or, backspace after the description to remove the final bracket and unhide the URL.
See <a href="http://orgmode.org/manual/Link-format.html#Link-format">Documentation on links</a>
</p>
</div>
</div>

<div id="outline-container-sec-4-2-7" class="outline-4">
<h4 id="sec-4-2-7"><span class="section-number-4">4.2.7</span> Scheduling time</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
To schedule a task, use C-c C-s.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c C-x ;</td>
<td class="left">Start a countdown timer (just ";" in agenda views).</td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol"><li><a id="sec-4-2-7-1"></a>Repeated tasks (recurring tasks)<br  /><div class="outline-text-5" id="text-4-2-7-1">
<p>
To schedule a recurring task (or "repeated task", see info org-mode 8.3.2):
     DEADLINE: <span class="timestamp-wrapper"><span class="timestamp">&lt;2005-10-01 Sat +1m&gt;</span></span>
</p>

<p>
Note the "+1m", that means to repeat every month.
</p>

<p>
You can use yearly, monthly, weekly, daily and hourly repeat cookies
by using the `y/w/m/d/h' letters.
</p>

<p>
If you need both a repeater and a special warning period in a deadline entry,
the repeater should come first and the warning period last: `DEADLINE:
<span class="timestamp-wrapper"><span class="timestamp">&lt;2005-10-01 Sat +1m -3d&gt;</span></span>'.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-2-8" class="outline-4">
<h4 id="sec-4-2-8"><span class="section-number-4">4.2.8</span> Agenda</h4>
<div class="outline-text-4" id="text-4-2-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">Schedule on date</td>
<td class="left">C-c C-s</td>
</tr>

<tr>
<td class="left">Change status (started, done, etc)</td>
<td class="left">C-c C-t</td>
</tr>

<tr>
<td class="left">Deadline</td>
<td class="left">C-c C-d</td>
</tr>

<tr>
<td class="left">kill item</td>
<td class="left">C-k</td>
</tr>
</tbody>
</table>
</div>
</div>
