org/emacs.org
*** Agenda view
The default key for opening agenda mode (M-x org-agenda) is =C-c C-a= followed by a
command key. Pressing "a" will open the agenda for day or week
(depending on the value of the variable =org-agenda-span=).

One simple way of effectively using org agenda is this:
- Capture TODO items using org capture
- When planning the work ahead of you, open the list of stored TODO
  items.
- Use =C-c C-s= to schedule the item. Just hit RET to schedule it
  for today.
- Open org-agenda-goto-today by pressing =C-c a a=

*** Importing ICS icalendar files

Emacs can import icalendar files to the diary using M-x icalendar-...
Org can then be set to read the diary files using:
#+BEGIN_SRC emacs-lisp
      (setq org-agenda-include-diary t)
#+END_SRC

*** Capture
|---------+--------------------------+------------------------------|
| C-c C-l | insert link              |                              |
| C-c C-a | insert attachment        |                              |
|         | open last stored capture | org-capture-goto-last-stored |
|---------+--------------------------+------------------------------|
*** Archiving
|-------------+-----------------------------+-------------------|
| C-c C-x C-a | org-archive-subtree-default | archives the item |
|-------------+-----------------------------+-------------------|

*** Searching and filtering in org
C-c / Use org-sparse-tree to filter out only matching headings.
i.e: "C-c / m blog" to show only headings containing the tag "blog"
*** Literate programming using org-babel

Insert code blocks:
#+BEGIN_SRC emacs-Lisp
    (foo)
#+END_SRC

Useful org-babel keybindings:
|-----------+------------------------+-------------------------------------------------------|
| key       | action                 | description                                           |
|-----------+------------------------+-------------------------------------------------------|
| C-c C-v t | org-tangle             |                                                       |
| C-c C-c   |                        | Evalute code block                                    |
| C-c '     |                        | Edit code block in separate buffer                    |
|           | org-src-fontify-block  | Applies syntax highlighting (font lock) to code block |
|           | org-src-fontify-buffer | (As above) to all code blocks in the buffer.          |
|-----------+------------------------+-------------------------------------------------------|

To easily create new code blocks, insert "<s" and hit "Tab" and a code
block will be created.
*** Exporting to HTML and other formats
C-c C-e opens the export menu (or "dispatcher").

More export configuration options can be found under: M-x customize-group org-export

**** Export with Table of contents configuration
Table of contents can be created with a configured to include all
levels of heading or just to a specified level.

M-x customize-variable org-export-with-toc

**** Export with heading numbering
M-x customize-variable org-export-with-section-numbers 

**** TODO Room for improvement
In my opinion, there is room to improve the Org export dispatch menu to
allow for:
- Configration of ToC (Table of contents) (whether it should be created or not, level of detail et c.)
- Whether or not headings should be rendered with numbers alongside them.
*** Editing math and special characters
First install packages auctex and cdlatex

Enable M-x org-cdlatex-mode

- see here: [[http://orgmode.org/manual/CDLaTeX-mode.html]]
*** Further study
[[[[http://orgmode.org/worg/doc.html][All]] hooks, commands and options of Org 8.0]
** Miscellaneous (git, magit, org-mode, gnus, diff ...)
*** Acceptable visual configurations
Dark: color-theme-dark-blue2, fringe-mode,
Font: Consolas 10, Dejavu Sans Mono 10
C-x C-+, C-x C-- - increase, decrease text size
*** Text zoom, default is C-x C-+, C-x C-- to resize text.

*** Magit for git version control
[[http://philjackson.github.com/magit/magit.html][Magit manual]]

magit-status will show the state of the repository

**** Useful magit-status keys and commands:
|---------+-------------------------------------|
| S-Tab   | toggle showing diff in place        |
| d       | Show a diff                         |
| e       | show ediff                          |
| c       | commit                              |
| s       | stage (and add files)               |
| v       | discard change                      |
| g       | refresh                             |
| C-u s   | stage all untracked files           |
| C-c C-c | commit (from change message buffer) |
| l       | show history                        |
|---------+-------------------------------------|
**** the log
pressing l opens the log
. - mark
= - compare the marked commit and the current (under cursor )commit
C-w - copy sha1 of commit into the kill ring

**** C-u commands:
C-u i, ask for filename to ignore (useful for directories)

**** mx-commands:
magit-ediff
*** Reading feeds with gnus
press G R to add a new feed.

*** Comparing files with diff, merging them with ediff
[[https://www.gnu.org/software/emacs/manual/html_node/ediff/][Ediff manual]]

Ediff opens up three frames, frame A and B and a small frame that controls the diffing using hotkeys
key ? shows help, "n" or space jumps to next diff, keys a/b copies region to A (upper frame)/B (lower)
key r followed by b restores the buffer in B
Q: How to undo the last action?
