emacs.html

<div id="outline-container-sec-4-2-9" class="outline-4">
<h4 id="sec-4-2-9"><span class="section-number-4">4.2.9</span> Agenda view</h4>
<div class="outline-text-4" id="text-4-2-9">
<p>
The default key for opening agenda mode (M-x org-agenda) is <code>C-c C-a</code> followed by a
command key. Pressing "a" will open the agenda for day or week
(depending on the value of the variable <code>org-agenda-span</code>).
</p>

<p>
One simple way of effectively using org agenda is this:
</p>
<ul class="org-ul">
<li>Capture TODO items using org capture
</li>
<li>When planning the work ahead of you, open the list of stored TODO
items.
</li>
<li>Use <code>C-c C-s</code> to schedule the item. Just hit RET to schedule it
for today.
</li>
<li>Open org-agenda-goto-today by pressing <code>C-c a a</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2-10" class="outline-4">
<h4 id="sec-4-2-10"><span class="section-number-4">4.2.10</span> Importing ICS icalendar files</h4>
<div class="outline-text-4" id="text-4-2-10">
<p>
Emacs can import icalendar files to the diary using M-x icalendar-&#x2026;
Org can then be set to read the diary files using:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-agenda-include-diary t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2-11" class="outline-4">
<h4 id="sec-4-2-11"><span class="section-number-4">4.2.11</span> Capture</h4>
<div class="outline-text-4" id="text-4-2-11">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c C-l</td>
<td class="left">insert link</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-c C-a</td>
<td class="left">insert attachment</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">open last stored capture</td>
<td class="left">org-capture-goto-last-stored</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-2-12" class="outline-4">
<h4 id="sec-4-2-12"><span class="section-number-4">4.2.12</span> Archiving</h4>
<div class="outline-text-4" id="text-4-2-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c C-x C-a</td>
<td class="left">org-archive-subtree-default</td>
<td class="left">archives the item</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-2-13" class="outline-4">
<h4 id="sec-4-2-13"><span class="section-number-4">4.2.13</span> Searching and filtering in org</h4>
<div class="outline-text-4" id="text-4-2-13">
<p>
C-c / Use org-sparse-tree to filter out only matching headings.
i.e: "C-c / m blog" to show only headings containing the tag "blog"
</p>
</div>
</div>
<div id="outline-container-sec-4-2-14" class="outline-4">
<h4 id="sec-4-2-14"><span class="section-number-4">4.2.14</span> Literate programming using org-babel</h4>
<div class="outline-text-4" id="text-4-2-14">
<p>
Insert code blocks:
</p>
<div class="org-src-container">

<pre class="src src-emacs-Lisp">(foo)
</pre>
</div>

<p>
Useful org-babel keybindings:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">key</th>
<th scope="col" class="left">action</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-c C-v t</td>
<td class="left">org-tangle</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-c C-c</td>
<td class="left">&#xa0;</td>
<td class="left">Evalute code block</td>
</tr>

<tr>
<td class="left">C-c '</td>
<td class="left">&#xa0;</td>
<td class="left">Edit code block in separate buffer</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">org-src-fontify-block</td>
<td class="left">Applies syntax highlighting (font lock) to code block</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">org-src-fontify-buffer</td>
<td class="left">(As above) to all code blocks in the buffer.</td>
</tr>
</tbody>
</table>

<p>
To easily create new code blocks, insert "&lt;s" and hit "Tab" and a code
block will be created.
</p>
</div>
</div>
<div id="outline-container-sec-4-2-15" class="outline-4">
<h4 id="sec-4-2-15"><span class="section-number-4">4.2.15</span> Exporting to HTML and other formats</h4>
<div class="outline-text-4" id="text-4-2-15">
<p>
C-c C-e opens the export menu (or "dispatcher").
</p>

<p>
More export configuration options can be found under: M-x customize-group org-export
</p>
</div>

<ol class="org-ol"><li><a id="sec-4-2-15-1"></a>Export with Table of contents configuration<br  /><div class="outline-text-5" id="text-4-2-15-1">
<p>
Table of contents can be created with a configured to include all
levels of heading or just to a specified level.
</p>

<p>
M-x customize-variable org-export-with-toc
</p>
</div>
</li>

<li><a id="sec-4-2-15-2"></a>Export with heading numbering<br  /><div class="outline-text-5" id="text-4-2-15-2">
<p>
M-x customize-variable org-export-with-section-numbers 
</p>
</div>
</li>

<li><a id="sec-4-2-15-3"></a><span class="todo TODO">TODO</span> Room for improvement<br  /><div class="outline-text-5" id="text-4-2-15-3">
<p>
In my opinion, there is room to improve the Org export dispatch menu to
allow for:
</p>
<ul class="org-ul">
<li>Configration of ToC (Table of contents) (whether it should be created or not, level of detail et c.)
</li>
<li>Whether or not headings should be rendered with numbers alongside them.
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-2-16" class="outline-4">
<h4 id="sec-4-2-16"><span class="section-number-4">4.2.16</span> Editing math and special characters</h4>
<div class="outline-text-4" id="text-4-2-16">
<p>
First install packages auctex and cdlatex
</p>

<p>
Enable M-x org-cdlatex-mode
</p>

<ul class="org-ul">
<li>see here: <a href="http://orgmode.org/manual/CDLaTeX-mode.html">http://orgmode.org/manual/CDLaTeX-mode.html</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2-17" class="outline-4">
<h4 id="sec-4-2-17"><span class="section-number-4">4.2.17</span> Further study</h4>
<div class="outline-text-4" id="text-4-2-17">
<p>
[[<a href="http://orgmode.org/worg/doc.html%5D%5BAll">http://orgmode.org/worg/doc.html%5D%5BAll</a> hooks, commands and options of Org 8.0]
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Miscellaneous (git, magit, org-mode, gnus, diff &#x2026;)</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Acceptable visual configurations</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Dark: color-theme-dark-blue2, fringe-mode,
Font: Consolas 10, Dejavu Sans Mono 10
C-x C-+, C-x C&#x2013; - increase, decrease text size
</p>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Text zoom, default is C-x C-+, C-x C&#x2013; to resize text.</h4>
</div>

<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Magit for git version control</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
<a href="http://philjackson.github.com/magit/magit.html">Magit manual</a>
</p>

<p>
magit-status will show the state of the repository
</p>
</div>

<ol class="org-ol"><li><a id="sec-4-3-3-1"></a>Useful magit-status keys and commands:<br  /><div class="outline-text-5" id="text-4-3-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">S-Tab</td>
<td class="left">toggle showing diff in place</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">Show a diff</td>
</tr>

<tr>
<td class="left">e</td>
<td class="left">show ediff</td>
</tr>

<tr>
<td class="left">c</td>
<td class="left">commit</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">stage (and add files)</td>
</tr>

<tr>
<td class="left">v</td>
<td class="left">discard change</td>
</tr>

<tr>
<td class="left">g</td>
<td class="left">refresh</td>
</tr>

<tr>
<td class="left">C-u s</td>
<td class="left">stage all untracked files</td>
</tr>

<tr>
<td class="left">C-c C-c</td>
<td class="left">commit (from change message buffer)</td>
</tr>

<tr>
<td class="left">l</td>
<td class="left">show history</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-4-3-3-2"></a>the log<br  /><div class="outline-text-5" id="text-4-3-3-2">
<p>
pressing l opens the log
. - mark
= - compare the marked commit and the current (under cursor )commit
C-w - copy sha1 of commit into the kill ring
</p>
</div>
</li>

<li><a id="sec-4-3-3-3"></a>C-u commands:<br  /><div class="outline-text-5" id="text-4-3-3-3">
<p>
C-u i, ask for filename to ignore (useful for directories)
</p>
</div>
</li>

<li><a id="sec-4-3-3-4"></a>mx-commands:<br  /><div class="outline-text-5" id="text-4-3-3-4">
<p>
magit-ediff
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> Reading feeds with gnus</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
press G R to add a new feed.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> Comparing files with diff, merging them with ediff</h4>
<div class="outline-text-4" id="text-4-3-5">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/ediff/">Ediff manual</a>
</p>

<p>
Ediff opens up three frames, frame A and B and a small frame that controls the diffing using hotkeys
key ? shows help, "n" or space jumps to next diff, keys a/b copies region to A (upper frame)/B (lower)
key r followed by b restores the buffer in B
Q: How to undo the last action?
</p>
</div>
</div>
