org/emacs.org
*** Visibility
Tab cycles visibility
|-----------+-----------------------------+---------------------------------------------------------------|
| C-c C-x b | org-tree-to-indirect-buffer | Shows the current subtree in a new buffer ("indirect buffer") |
|-----------+-----------------------------+---------------------------------------------------------------|
* Extending Emacs (Emacs Lisp)
** Learn Emacs lisp
[[http://www.emacswiki.orpg/emacs/LearnEmacsLisp]]

*** Use ‘C-x ESC ESC’ to repeat commands you execute, and look at the Emacs-Lisp code that executes them, before hitting ‘RET’ (Return) – see RepeatLastCommand.


*** Use ‘C-h f’ (‘describe-function’) and ‘C-h v’ (‘describe-variable’) to understand commands and variables you use. In the help description, click the function or variable name (link) to go directly to the source code that defines it. Try to read the source code. When you want to know what some function you see used does, use ‘C-h f’ on it… Got it?


*** Use ‘C-h k’ to see which commands you are executing when you use keys. Then follow the previous bullet: click the name (link) of the command to see its source code…


*** Read the Emacs Lisp Introduction: EmacsLispIntro. Use ‘C-h i’, then choose `Emacs Lisp Intro’. You can also read this manual on the Web.


*** Read the Emacs Lisp Reference manual: EmacsLispReference. Use ‘C-h i’, then choose ‘Elisp’ (Emacs Lisp is sometimes called “Elisp”). You can also read this manual on the Web.
SteveYegge’s intro to the language. (FIXME: Link)

** Resources
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/][E-lisp manual]], 
[[http://www.gnu.org/software/emacs/emacs-lisp-intro/][Introduction to Emacs Lisp]]
** Basics
Comparisons: note the difference between "eq" and "equal". While "eq" tests if x and y are the same object, "equal" tests if they have equal contents.

** Evaluating lisp code
*** ielm
M-x ielm will run a REPL, similar to a Python "interpreter" but for Elisp.
(For other REPLs see SLIME, nrepl)

** C-x C-e evaluates last expression (Position the cursor after the expression)
** Debugging
(bisect) -- If "emacs --debug-init"
           doesn't help, comment out half of ~/.emacs and try to
           reproduce the issue. Recurse as necessary. See also
           <-q> and <ielm>.

Another type of "bisect" method is putting (message "DEBUG ONE"), (message "DEBUG TWO") in various locations in the code to find where it fails.
** Useful e-lisp basics
(message "hi") outputs a message to the *Message* buffer, this can be useful for debugging.

** using 'package
There's a repository called [[http://marmalde-repo.org]["marmalade"]] that contains an assortment of extensions
** Keybindings
[[http://www.masteringemacs.org/articles/2011/02/08/mastering-key-bindings-emacs/][Mastering keybindings in Emacs]]

M-x describe-bindings or C-h b displays all keybindings

** Colortheme extension
use M-x color-theme-print to save your own colortheme
** Macros
F3, F4 (or C-x (, C-x ) ) to begin and end recording of a macro.
M-x name-last-kbd-macro
** Parentheses
*** Paredit
=paredit-mode= 
C-q, force insert of parentheses.
M-(  Wrap parens around something
M-s Remove parens from something
M-S-s Split sexpr into two
M-S-j join sexprs
C-u DEL force delete paren or bracket.


Further info:
[[http://p.hagelb.org/paredit-screencast.html]]

*** Test
#+BEGIN_SRC emacs-lisp
    (defun foo ()
    "foo is cool"
    )
    (message "hi")
#+END_SRC
*** Jump to matching parentheses
[[http://emacs-fu.blogspot.se/2009/01/balancing-your-parentheses.html][Balancing your parentheses - emacs fu]]

#+BEGIN_SRC emacs-lisp
    (defun paren-match ()
    "Tries to jump to the matching parenthesis to the one currently
    under the point. Useful if the matching paren is out of sight. "
    (interactive)
    (cond ((looking-at "[{\[\(]") (forward-sexp 1) (backward-char))
    ((looking-at "[]})]") (forward-char) (backward-sexp 1))
    (t (message "Point not at a parenthesis."))))
#+END_SRC
* Personal notes
** System/platform specific
*** My current emacs notes for Win8

~/.emacs is in
- c:/Users/jmn/Appdata/Roaming/.emacs
** For me to check out
- Sauron (by djcb)
  [[https://github.com/djcb/sauron]] 

  Sauron is an emacs mode for keeping track of events happening
  in the (emacs) world around you. Events are things like ‘appointment
  in 5 minutes’, ‘bob pinged you on IRC’, ‘torrent download is
  complete’ etc. Sauron shows those events like a list – basically
  like a log. You can ‘activate’ an event by either pressing RET when
  point is on it, or clicking it with the middle mouse button
  (<mouse-2>).
** Wouldn't it be great if... / Wishlist
Better bookmarks: If the bookmarks could show the title of each document. 
* Meta
