emacs.html
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> Visibility</h4>
<div class="outline-text-4" id="text-4-3-6">
<p>
Tab cycles visibility
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c C-x b</td>
<td class="left">org-tree-to-indirect-buffer</td>
<td class="left">Shows the current subtree in a new buffer ("indirect buffer")</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Extending Emacs (Emacs Lisp)</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Learn Emacs lisp</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="http://www.emacswiki.orpg/emacs/LearnEmacsLisp">http://www.emacswiki.orpg/emacs/LearnEmacsLisp</a>
</p>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Use ‘C-x ESC ESC’ to repeat commands you execute, and look at the Emacs-Lisp code that executes them, before hitting ‘RET’ (Return) – see RepeatLastCommand.</h4>
</div>


<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Use ‘C-h f’ (‘describe-function’) and ‘C-h v’ (‘describe-variable’) to understand commands and variables you use. In the help description, click the function or variable name (link) to go directly to the source code that defines it. Try to read the source code. When you want to know what some function you see used does, use ‘C-h f’ on it… Got it?</h4>
</div>


<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> Use ‘C-h k’ to see which commands you are executing when you use keys. Then follow the previous bullet: click the name (link) of the command to see its source code…</h4>
</div>


<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> Read the Emacs Lisp Introduction: EmacsLispIntro. Use ‘C-h i’, then choose `Emacs Lisp Intro’. You can also read this manual on the Web.</h4>
</div>


<div id="outline-container-sec-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="section-number-4">5.1.5</span> Read the Emacs Lisp Reference manual: EmacsLispReference. Use ‘C-h i’, then choose ‘Elisp’ (Emacs Lisp is sometimes called “Elisp”). You can also read this manual on the Web.</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
SteveYegge’s intro to the language. (FIXME: Link)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Resources</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/">E-lisp manual</a>, 
<a href="http://www.gnu.org/software/emacs/emacs-lisp-intro/">Introduction to Emacs Lisp</a>
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Basics</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Comparisons: note the difference between "eq" and "equal". While "eq" tests if x and y are the same object, "equal" tests if they have equal contents.
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Evaluating lisp code</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> ielm</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
M-x ielm will run a REPL, similar to a Python "interpreter" but for Elisp.
(For other REPLs see SLIME, nrepl)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> C-x C-e evaluates last expression (Position the cursor after the expression)</h3>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Debugging</h3>
<div class="outline-text-3" id="text-5-6">
<p>
(bisect) &#x2013; If "emacs &#x2013;debug-init"
           doesn't help, comment out half of ~/.emacs and try to
           reproduce the issue. Recurse as necessary. See also
           &lt;-q&gt; and &lt;ielm&gt;.
</p>

<p>
Another type of "bisect" method is putting (message "DEBUG ONE"), (message "DEBUG TWO") in various locations in the code to find where it fails.
</p>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> Useful e-lisp basics</h3>
<div class="outline-text-3" id="text-5-7">
<p>
(message "hi") outputs a message to the <b>Message</b> buffer, this can be useful for debugging.
</p>
</div>
</div>

<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> using 'package</h3>
<div class="outline-text-3" id="text-5-8">
<p>
There's a repository called <a href="http://marmalde-repo.org/">"marmalade"</a> that contains an assortment of extensions
</p>
</div>
</div>
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> Keybindings</h3>
<div class="outline-text-3" id="text-5-9">
<p>
<a href="http://www.masteringemacs.org/articles/2011/02/08/mastering-key-bindings-emacs/">Mastering keybindings in Emacs</a>
</p>

<p>
M-x describe-bindings or C-h b displays all keybindings
</p>
</div>
</div>

<div id="outline-container-sec-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> Colortheme extension</h3>
<div class="outline-text-3" id="text-5-10">
<p>
use M-x color-theme-print to save your own colortheme
</p>
</div>
</div>
<div id="outline-container-sec-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> Macros</h3>
<div class="outline-text-3" id="text-5-11">
<p>
F3, F4 (or C-x (, C-x ) ) to begin and end recording of a macro.
M-x name-last-kbd-macro
</p>
</div>
</div>
<div id="outline-container-sec-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> Parentheses</h3>
<div class="outline-text-3" id="text-5-12">
</div><div id="outline-container-sec-5-12-1" class="outline-4">
<h4 id="sec-5-12-1"><span class="section-number-4">5.12.1</span> Paredit</h4>
<div class="outline-text-4" id="text-5-12-1">
<p>
<code>paredit-mode</code> 
C-q, force insert of parentheses.
M-(  Wrap parens around something
M-s Remove parens from something
M-S-s Split sexpr into two
M-S-j join sexprs
C-u DEL force delete paren or bracket.
</p>


<p>
Further info:
<a href="http://p.hagelb.org/paredit-screencast.html">http://p.hagelb.org/paredit-screencast.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-5-12-2" class="outline-4">
<h4 id="sec-5-12-2"><span class="section-number-4">5.12.2</span> Test</h4>
<div class="outline-text-4" id="text-5-12-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">foo</span> ()
<span style="color: #e9b96e;">"foo is cool"</span>
)
(message <span style="color: #e9b96e;">"hi"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-12-3" class="outline-4">
<h4 id="sec-5-12-3"><span class="section-number-4">5.12.3</span> Jump to matching parentheses</h4>
<div class="outline-text-4" id="text-5-12-3">
<p>
<a href="http://emacs-fu.blogspot.se/2009/01/balancing-your-parentheses.html">Balancing your parentheses - emacs fu</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">paren-match</span> ()
<span style="color: #e9b96e;">"Tries to jump to the matching parenthesis to the one currently</span>
<span style="color: #e9b96e;">under the point. Useful if the matching paren is out of sight. "</span>
(interactive)
(<span style="color: #b4fa70;">cond</span> ((looking-at <span style="color: #e9b96e;">"[{\[\(]"</span>) (forward-sexp 1) (backward-char))
((looking-at <span style="color: #e9b96e;">"[]})]"</span>) (forward-char) (backward-sexp 1))
(t (message <span style="color: #e9b96e;">"Point not at a parenthesis."</span>))))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Personal notes</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> System/platform specific</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> My current emacs notes for Win8</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
~/.emacs is in
</p>
<ul class="org-ul">
<li>c:/Users/jmn/Appdata/Roaming/.emacs
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> For me to check out</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><p>
Sauron (by djcb)
<a href="https://github.com/djcb/sauron">https://github.com/djcb/sauron</a> 
</p>

<p>
Sauron is an emacs mode for keeping track of events happening
in the (emacs) world around you. Events are things like ‘appointment
in 5 minutes’, ‘bob pinged you on IRC’, ‘torrent download is
complete’ etc. Sauron shows those events like a list – basically
like a log. You can ‘activate’ an event by either pressing RET when
point is on it, or clicking it with the middle mouse button
(&lt;mouse-2&gt;).
</p>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Wouldn't it be great if&#x2026; / Wishlist</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Better bookmarks: If the bookmarks could show the title of each document. 
</p>
</div>
</div>
</div>
